জাভাস্ক্রিপ্টে Callback Function (কলব্যাক ফাংশন) হলো এমন একটি ফাংশন, যাকে অন্য একটি ফাংশনের ভেতর আর্গুমেন্ট (Argument) হিসেবে পাস করা হয় এবং পরবর্তী সময়ে
ওই মূল ফাংশনের ভেতর থেকে তাকে কল বা এক্সিকিউট করা হয়।

🧠 কেন CallBack Function প্রয়োজন?
  
জাভাস্ক্রিপ্ট হলো একটি Synchronous এবং Single-threaded ল্যাঙ্গুয়েজ। এর মানে হলো জাভাস্ক্রিপ্ট ওপর থেকে নিচে এক লাইন এক লাইন করে কোড রান করে।

কিন্তু রিয়েল-লাইফে কিছু কাজ শেষ হতে সময় লাগে—যেমন:

সার্ভার থেকে ডেটা ফেচ (Fetch) করা

ফাইল রিড করা

কোনো টাইমার বা ইউজার ক্লিক ইভেন্টের জন্য অপেক্ষা করা

এসব কাজ যদি জাভাস্ক্রিপ্ট থামিয়ে রেখে অপেক্ষা করতে যায়, তবে পুরো ওয়েবসাইট ফ্রিজ হয়ে যাবে। এই Asynchronous (অ্যাসিঙ্ক্রোনাস) বা অপেক্ষার কাজগুলো হ্যান্ডেল করার জন্যই কলব্যাক ফাংশনের জন্ম।

Simple Syntex;

function getMyName (myName) {
    myName( );
}

let details = function() {
    console.log("Abdullah Aziz");
};

getMyName(details);
