📌 Return Statement কী?
return স্টেটমেন্ট ব্যবহার করে একটি ফাংশন থেকে মান ফেরত দেওয়া হয় (return করা হয়)। যখন JavaScript return পায়, 
তখন ফাংশনের কাজ শেষ হয়ে যায় এবং যে মানটি return করা হয় সেটি ফাংশন কলের জায়গায় চলে যায়।


জাভাস্ক্রিপ্টে return Statement (রিটার্ন স্টেটমেন্ট) হলো যেকোনো ফাংশনের শেষ সীমানা এবং তার আউটপুট দেওয়ার একমাত্র উপায়। যখন কোনো ফাংশনকে দিয়ে কোনো কাজ করানো হয়, 
তখন সেই কাজের ফলাফল বা রেজাল্ট নিজের হাতে ফেরত পাওয়ার জন্যই return ব্যবহার করা হয়।


বেসিক সিনট্যাক্স

function functionName(parameters) {
    // ফাংশনের কাজ
    return value;  // ফাংশন থেকে value রিটার্ন করে
}

// ফাংশন কল করলে রিটার্ন ভ্যালু পাবেন
let result = functionName(arguments);
























